app/controllers/servers_controller.rb

INSERT INTO "servers" ("created_at", "public_name", "updated_at", "type", "alias", "private_ip", "private_name", "public_ip", "status", "image") VALUES('2010-06-30 18:45:34', 'a', '2010-06-30 18:45:34', NULL, 'a', 'a', 'a', 'a', 'a', 'a')
---
  def create
    @server = Server.new(params[:server])

    respond_to do |format|
      if @server.save